These changes are applied:

```console
$ aws-vault exec artichokeruby-forge-admin -- terraform apply
module.github_actions_runner_read_only.aws_iam_group.group: Refreshing state... [id=artichoke-forge-github-actions-readonly]
aws_iam_account_password_policy.this: Refreshing state... [id=iam-account-password-policy]
module.github_actions_runner_read_only.aws_iam_user.user["project-infrastructure"]: Refreshing state... [id=github-actions-repo-project-infrastructure]
module.github_actions_runner_read_only.aws_iam_group_policy.policy: Refreshing state... [id=artichoke-forge-github-actions-readonly:artichoke-forge-github-actions-readonly]
module.github_actions_runner_read_only.aws_iam_group_membership.membership: Refreshing state... [id=artichoke-forge-github-actions-readonly]
module.github_actions_runner_read_only.aws_iam_access_key.key["project-infrastructure"]: Refreshing state... [id=AKIAWQMTSZCGX2SMGAFJ]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.github_actions_project_infrastructure_assume_role.data.aws_iam_policy_document.github_allow will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github_allow"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "repo:artichoke/project-infrastructure:*",
                ]
              + variable = "token.actions.githubusercontent.com:sub"
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github will be created
  + resource "aws_iam_openid_connect_provider" "github" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "managed_by" = "terraform"
          + "project"    = "aws"
        }
      + thumbprint_list = [
          + "66bdd7c74d920085f0a986fb5ae3ab4faccaf635",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only will be created
  + resource "aws_iam_policy" "terraform_state_read_only" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "github-actions-artichoke-project-infrastructure-tf-state-ro"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-project-infrastructure-terraform-state"
                      + Sid      = "1"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::artichoke-forge-project-infrastructure-terraform-state/*"
                      + Sid      = "2"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "managed_by" = "terraform"
          + "project"    = "aws"
        }
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github-actions-artichoke-project-infrastructure-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "managed_by" = "terraform"
          + "project"    = "aws"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only will be created
  + resource "aws_iam_role_policy_attachment" "terraform_state_read_only" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "github-actions-artichoke-project-infrastructure-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_actions_project_infrastructure_assume_role_arn = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github: Creating...
module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only: Creating...
module.github_actions_project_infrastructure_assume_role.aws_iam_openid_connect_provider.github: Creation complete after 1s [id=arn:aws:iam::447522982029:oidc-provider/token.actions.githubusercontent.com]
module.github_actions_project_infrastructure_assume_role.data.aws_iam_policy_document.github_allow: Reading...
module.github_actions_project_infrastructure_assume_role.data.aws_iam_policy_document.github_allow: Read complete after 0s [id=2731449131]
module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role: Creating...
module.github_actions_project_infrastructure_assume_role.aws_iam_policy.terraform_state_read_only: Creation complete after 1s [id=arn:aws:iam::447522982029:policy/github-actions-artichoke-project-infrastructure-tf-state-ro]
module.github_actions_project_infrastructure_assume_role.aws_iam_role.github_role: Creation complete after 2s [id=github-actions-artichoke-project-infrastructure-role]
module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only: Creating...
module.github_actions_project_infrastructure_assume_role.aws_iam_role_policy_attachment.terraform_state_read_only: Creation complete after 1s [id=github-actions-artichoke-project-infrastructure-role-20211122053002053400000001]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

Outputs:

config = <sensitive>
github_actions_iam_access_ids = {
  "project-infrastructure" = "AKIAWQMTSZCGX2SMGAFJ"
}
github_actions_iam_secret_keys = <sensitive>
github_actions_project_infrastructure_assume_role_arn = "arn:aws:iam::447522982029:role/github-actions-artichoke-project-infrastructure-role"
```